#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.cloudnat-gke-zurich.google_compute_address.address[0] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west6-a"
      + network_tier       = (known after apply)
      + project            = "focus-ensign-274916"
      + purpose            = (known after apply)
      + region             = "europe-west6"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-zurich.google_compute_address.address[1] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west6-b"
      + network_tier       = (known after apply)
      + project            = "focus-ensign-274916"
      + purpose            = (known after apply)
      + region             = "europe-west6"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-zurich.google_compute_address.address[2] will be created
  + resource "google_compute_address" "address" {
      + address            = (known after apply)
      + address_type       = "EXTERNAL"
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "nat-external-address-europe-west6-c"
      + network_tier       = (known after apply)
      + project            = "focus-ensign-274916"
      + purpose            = (known after apply)
      + region             = "europe-west6"
      + self_link          = (known after apply)
      + subnetwork         = (known after apply)
      + users              = (known after apply)
    }

  # module.cloudnat-gke-zurich.google_compute_router.router will be created
  + resource "google_compute_router" "router" {
      + creation_timestamp = (known after apply)
      + id                 = (known after apply)
      + name               = "cloud-router-europe-west6"
      + network            = "network-gke"
      + project            = "focus-ensign-274916"
      + region             = "europe-west6"
      + self_link          = (known after apply)
    }

  # module.cloudnat-gke-zurich.google_compute_router_nat.advanced-nat will be created
  + resource "google_compute_router_nat" "advanced-nat" {
      + icmp_idle_timeout_sec              = 30
      + id                                 = (known after apply)
      + name                               = "nat-europe-west6"
      + nat_ip_allocate_option             = "MANUAL_ONLY"
      + nat_ips                            = (known after apply)
      + project                            = "focus-ensign-274916"
      + region                             = "europe-west6"
      + router                             = "cloud-router-europe-west6"
      + source_subnetwork_ip_ranges_to_nat = "ALL_SUBNETWORKS_ALL_IP_RANGES"
      + tcp_established_idle_timeout_sec   = 1200
      + tcp_transitory_idle_timeout_sec    = 30
      + udp_idle_timeout_sec               = 30

      + log_config {
          + enable = true
          + filter = "ERRORS_ONLY"
        }
    }

  # module.gke_stg_container_cluster.google_container_cluster.primary will be created
  + resource "google_container_cluster" "primary" {
      + additional_zones            = (known after apply)
      + cluster_ipv4_cidr           = (known after apply)
      + default_max_pods_per_node   = 110
      + enable_binary_authorization = false
      + enable_intranode_visibility = false
      + enable_kubernetes_alpha     = false
      + enable_legacy_abac          = false
      + enable_shielded_nodes       = false
      + enable_tpu                  = false
      + endpoint                    = (known after apply)
      + id                          = (known after apply)
      + initial_node_count          = 1
      + instance_group_urls         = (known after apply)
      + ip_allocation_policy        = [
          + {
              + cluster_ipv4_cidr_block       = (known after apply)
              + cluster_secondary_range_name  = "pods"
              + create_subnetwork             = (known after apply)
              + node_ipv4_cidr_block          = (known after apply)
              + services_ipv4_cidr_block      = (known after apply)
              + services_secondary_range_name = "services"
              + subnetwork_name               = (known after apply)
              + use_ip_aliases                = true
            },
        ]
      + location                    = "europe-west6-a"
      + logging_service             = "logging.googleapis.com"
      + master_version              = (known after apply)
      + min_master_version          = "1.15"
      + monitoring_service          = "monitoring.googleapis.com"
      + name                        = "gke-stg"
      + network                     = (known after apply)
      + node_locations              = (known after apply)
      + node_version                = (known after apply)
      + project                     = "focus-ensign-274916"
      + region                      = (known after apply)
      + remove_default_node_pool    = true
      + services_ipv4_cidr          = (known after apply)
      + subnetwork                  = (known after apply)
      + tpu_ipv4_cidr_block         = (known after apply)
      + zone                        = (known after apply)

      + addons_config {
          + cloudrun_config {
              + disabled = false
            }

          + horizontal_pod_autoscaling {
              + disabled = false
            }

          + http_load_balancing {
              + disabled = false
            }

          + istio_config {
              + disabled = true
            }

          + kubernetes_dashboard {
              + disabled = (known after apply)
            }

          + network_policy_config {
              + disabled = false
            }
        }

      + authenticator_groups_config {
          + security_group = (known after apply)
        }

      + cluster_autoscaling {
          + enabled = (known after apply)

          + resource_limits {
              + maximum       = (known after apply)
              + minimum       = (known after apply)
              + resource_type = (known after apply)
            }
        }

      + database_encryption {
          + key_name = (known after apply)
          + state    = (known after apply)
        }

      + maintenance_policy {
          + daily_maintenance_window {
              + duration   = (known after apply)
              + start_time = "03:00"
            }
        }

      + master_auth {
          + client_certificate     = (known after apply)
          + client_key             = (sensitive value)
          + cluster_ca_certificate = (known after apply)

          + client_certificate_config {
              + issue_client_certificate = false
            }
        }

      + master_authorized_networks_config {
          + cidr_blocks {
              + cidr_block   = "109.249.184.194/32"
              + display_name = "Home"
            }
        }

      + network_policy {
          + enabled  = true
          + provider = "CALICO"
        }

      + node_config {
          + disk_size_gb      = (known after apply)
          + disk_type         = (known after apply)
          + guest_accelerator = (known after apply)
          + image_type        = (known after apply)
          + labels            = (known after apply)
          + local_ssd_count   = (known after apply)
          + machine_type      = (known after apply)
          + metadata          = (known after apply)
          + min_cpu_platform  = (known after apply)
          + oauth_scopes      = (known after apply)
          + preemptible       = (known after apply)
          + service_account   = (known after apply)
          + tags              = (known after apply)

          + sandbox_config {
              + sandbox_type = (known after apply)
            }

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + taint {
              + effect = (known after apply)
              + key    = (known after apply)
              + value  = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = (known after apply)
            }
        }

      + node_pool {
          + initial_node_count  = (known after apply)
          + instance_group_urls = (known after apply)
          + max_pods_per_node   = (known after apply)
          + name                = (known after apply)
          + name_prefix         = (known after apply)
          + node_count          = (known after apply)
          + node_locations      = (known after apply)
          + version             = (known after apply)

          + autoscaling {
              + max_node_count = (known after apply)
              + min_node_count = (known after apply)
            }

          + management {
              + auto_repair  = (known after apply)
              + auto_upgrade = (known after apply)
            }

          + node_config {
              + disk_size_gb      = (known after apply)
              + disk_type         = (known after apply)
              + guest_accelerator = (known after apply)
              + image_type        = (known after apply)
              + labels            = (known after apply)
              + local_ssd_count   = (known after apply)
              + machine_type      = (known after apply)
              + metadata          = (known after apply)
              + min_cpu_platform  = (known after apply)
              + oauth_scopes      = (known after apply)
              + preemptible       = (known after apply)
              + service_account   = (known after apply)
              + tags              = (known after apply)

              + sandbox_config {
                  + sandbox_type = (known after apply)
                }

              + shielded_instance_config {
                  + enable_integrity_monitoring = (known after apply)
                  + enable_secure_boot          = (known after apply)
                }

              + taint {
                  + effect = (known after apply)
                  + key    = (known after apply)
                  + value  = (known after apply)
                }

              + workload_metadata_config {
                  + node_metadata = (known after apply)
                }
            }
        }

      + release_channel {
          + channel = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + update = "30m"
        }
    }

  # module.gke_stg_default.google_container_node_pool.node_pool will be created
  + resource "google_container_node_pool" "node_pool" {
      + cluster             = "gke-stg"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "europe-west6-a"
      + max_pods_per_node   = 110
      + name                = "default"
      + name_prefix         = (known after apply)
      + node_count          = 1
      + node_locations      = (known after apply)
      + project             = "focus-ensign-274916"
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "gke-stg"
              + "node_pool"    = "default"
              + "workload"     = "default"
            }
          + local_ssd_count   = 0
          + machine_type      = "custom-2-13312"
          + metadata          = (known after apply)
          + min_cpu_platform  = "Intel Broadwell"
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + taint {
              + effect = "NO_SCHEDULE"
              + key    = "workload"
              + value  = "default"
            }

          + workload_metadata_config {
              + node_metadata = "SECURE"
            }
        }
    }

  # module.gke_stg_default.google_project_iam_member.project-cloudsql will be created
  + resource "google_project_iam_member" "project-cloudsql" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/cloudsql.client"
    }

  # module.gke_stg_default.google_project_iam_member.project-logging-writer will be created
  + resource "google_project_iam_member" "project-logging-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/logging.logWriter"
    }

  # module.gke_stg_default.google_project_iam_member.project-metric-writer will be created
  + resource "google_project_iam_member" "project-metric-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke_stg_default.google_project_iam_member.project-trace-agent will be created
  + resource "google_project_iam_member" "project-trace-agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/cloudtrace.agent"
    }

  # module.gke_stg_default.google_service_account.node_pool_service_account will be created
  + resource "google_service_account" "node_pool_service_account" {
      + account_id   = (known after apply)
      + display_name = "default"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "focus-ensign-274916"
      + unique_id    = (known after apply)
    }

  # module.gke_stg_default.random_string.this will be created
  + resource "random_string" "this" {
      + id          = (known after apply)
      + keepers     = {
          + "project" = "focus-ensign-274916"
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.gke_stg_system.google_container_node_pool.node_pool will be created
  + resource "google_container_node_pool" "node_pool" {
      + cluster             = "gke-stg"
      + id                  = (known after apply)
      + initial_node_count  = (known after apply)
      + instance_group_urls = (known after apply)
      + location            = "europe-west6-a"
      + max_pods_per_node   = 110
      + name                = "system"
      + name_prefix         = (known after apply)
      + node_count          = 1
      + node_locations      = (known after apply)
      + project             = "focus-ensign-274916"
      + region              = (known after apply)
      + version             = (known after apply)
      + zone                = (known after apply)

      + autoscaling {
          + max_node_count = 2
          + min_node_count = 1
        }

      + management {
          + auto_repair  = true
          + auto_upgrade = true
        }

      + node_config {
          + disk_size_gb      = 30
          + disk_type         = "pd-ssd"
          + guest_accelerator = (known after apply)
          + image_type        = "COS"
          + labels            = {
              + "cluster_name" = "gke-stg"
              + "node_pool"    = "system"
            }
          + local_ssd_count   = 0
          + machine_type      = "custom-2-13312"
          + metadata          = (known after apply)
          + min_cpu_platform  = "Intel Broadwell"
          + oauth_scopes      = [
              + "https://www.googleapis.com/auth/cloud-platform",
            ]
          + preemptible       = false
          + service_account   = (known after apply)

          + shielded_instance_config {
              + enable_integrity_monitoring = (known after apply)
              + enable_secure_boot          = (known after apply)
            }

          + workload_metadata_config {
              + node_metadata = "SECURE"
            }
        }
    }

  # module.gke_stg_system.google_project_iam_member.project-cloudsql will be created
  + resource "google_project_iam_member" "project-cloudsql" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/cloudsql.client"
    }

  # module.gke_stg_system.google_project_iam_member.project-logging-writer will be created
  + resource "google_project_iam_member" "project-logging-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/logging.logWriter"
    }

  # module.gke_stg_system.google_project_iam_member.project-metric-writer will be created
  + resource "google_project_iam_member" "project-metric-writer" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/monitoring.metricWriter"
    }

  # module.gke_stg_system.google_project_iam_member.project-trace-agent will be created
  + resource "google_project_iam_member" "project-trace-agent" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "focus-ensign-274916"
      + role    = "roles/cloudtrace.agent"
    }

  # module.gke_stg_system.google_service_account.node_pool_service_account will be created
  + resource "google_service_account" "node_pool_service_account" {
      + account_id   = (known after apply)
      + display_name = "system"
      + email        = (known after apply)
      + id           = (known after apply)
      + name         = (known after apply)
      + project      = "focus-ensign-274916"
      + unique_id    = (known after apply)
    }

  # module.gke_stg_system.random_string.this will be created
  + resource "random_string" "this" {
      + id          = (known after apply)
      + keepers     = {
          + "project" = "focus-ensign-274916"
        }
      + length      = 6
      + lower       = true
      + min_lower   = 0
      + min_numeric = 0
      + min_special = 0
      + min_upper   = 0
      + number      = false
      + result      = (known after apply)
      + special     = false
      + upper       = false
    }

  # module.network_stg_gke.google_compute_network.network will be created
  + resource "google_compute_network" "network" {
      + auto_create_subnetworks         = false
      + delete_default_routes_on_create = false
      + description                     = "GKE STG VPC"
      + gateway_ipv4                    = (known after apply)
      + id                              = (known after apply)
      + name                            = "network-gke"
      + project                         = "focus-ensign-274916"
      + routing_mode                    = "GLOBAL"
      + self_link                       = (known after apply)
    }

  # module.subnetwork_stg_gke.google_compute_subnetwork.subnetwork will be created
  + resource "google_compute_subnetwork" "subnetwork" {
      + creation_timestamp       = (known after apply)
      + description              = "GKE STG Subnet"
      + enable_flow_logs         = (known after apply)
      + fingerprint              = (known after apply)
      + gateway_address          = (known after apply)
      + id                       = (known after apply)
      + ip_cidr_range            = "10.2.64.0/18"
      + name                     = "sn-gke"
      + network                  = (known after apply)
      + private_ip_google_access = true
      + project                  = "focus-ensign-274916"
      + region                   = "europe-west6"
      + secondary_ip_range       = [
          + {
              + ip_cidr_range = "10.2.128.0/17"
              + range_name    = "pods"
            },
          + {
              + ip_cidr_range = "10.2.0.0/19"
              + range_name    = "services"
            },
          + {
              + ip_cidr_range = "10.2.32.0/19"
              + range_name    = "misc"
            },
        ]
      + self_link                = (known after apply)

      + log_config {
          + aggregation_interval = (known after apply)
          + flow_sampling        = (known after apply)
          + metadata             = (known after apply)
        }
    }

Plan: 22 to add, 0 to change, 0 to destroy.

Warning: Quoted references are deprecated

  on .terraform/modules/gke_dev_container_cluster/container_cluster/main.tf line 2, in resource "google_container_cluster" "primary":
   2:   provider                    = "google-beta"

In this context, references are expected literally rather than in quotes.
Terraform 0.11 and earlier required quotes, but quoted references are now
deprecated and will be removed in a future version of Terraform. Remove the
quotes surrounding this reference to silence this warning.

(and 5 more similar warnings elsewhere)


Warning: Interpolation-only expressions are deprecated

  on .terraform/modules/gke_dev_default/node_pool/sa.tf line 2, in resource "google_service_account" "node_pool_service_account":
   2:   project      = "${random_string.this.keepers.project}"

Terraform 0.11 and earlier required all non-constant expressions to be
provided via interpolation syntax, but this pattern is now deprecated. To
silence this warning, remove the "${ sequence from the start and the }"
sequence from the end of this expression, leaving just the inner expression.

Template interpolation syntax is still used to construct strings from
expressions when the template includes multiple interpolation sequences or a
mixture of literal strings and interpolations. This deprecation applies only
to templates that consist entirely of a single interpolation sequence.

(and 19 more similar warnings elsewhere)

```

</details>

*Workflow: `Terraform`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
